[
  {
    "_id": "f69a695f037cd9484cecaea37ca71011",
    "category_id": "01",

    "total_enroll": 210,
    "title": "HTML & CSS",
    "published_date": "2022-08-30 16:38:45",
    "price": 12,
    "image_url": "https://tolustar.com/wp-content/uploads/2020/02/html-css.jpg",
    "details": "Become a modern and confident HTML and CSS developer, no prior knowledge needed! HTML is the foundation of all web pages. It defines the structure of a page, while CSS defines its style. HTML and CSS are the beginning of everything you need to know to make your first web page! Learn both and start creating amazing websites. "
  },
  {
    "_id": "f69a695f037cd9484cecaea37ca71012",
    "category_id": "02",

    "total_enroll": 400,
    "title": "JavaScript",
    "published_date": "2022-08-30 16:38:45",
    "price": 30,
    "image_url": "https://cdn.acodez.in/wp-content/uploads/2019/08/History-of-javascript.jpg",
    "details": "The JavaScript programming language is fun and flexible. It’s one of the core technologies of web development and can be used on both the front-end and the back-end. You will learn programming fundamentals and basic object-oriented concepts using the latest JavaScript syntax. The concepts covered in these lessons lay the foundation for using JavaScript in any environment."
  },

  {
    "_id": "11468ed61aee84de492a8b04158a22f9",
    "category_id": "03",

    "total_enroll": 80,
    "title": "React Js",
    "published_date": "2022-08-24 23:15:00",
    "price": 21,
    "image_url": "https://sc04.alicdn.com/kf/U0721a48732814105aae97d2245765dd2a.png",
    "details": "Dive in and learn React.js from scratch! Learn Reactjs, Hooks, Redux, React Routing, Animations, Next.js and way more! React.js is THE most popular JavaScript library you can use and learn these days to build modern, reactive user interfaces for the web. This course teaches you React in-depth, from the ground up, step by step by diving into all the core basics, exploring tons of examples and also introducing you to advanced concepts as well."
  },
  {
    "_id": "11468ed61aee84de492a8b04158a22f0",
    "category_id": "04",

    "total_enroll": 38,
    "title": "Node Js",
    "published_date": "2022-08-24 23:15:00",
    "price": 26,
    "image_url": "https://sc04.alicdn.com/kf/A40f3c3dc6874425d89fd7a5207ee4ded4.png",
    "details": "Get advanced with Node.Js! Learn caching with Redis, speed up through clustering, and add image upload with S3 and Node! There are two types of engineers: those who can describe the Event Loop and those who cannot!  This course will ensure that you are incredibly well prepared to answer that most important question.  Besides being critical for interviews, knowledge of the Event Loop will give you a better understanding of how Node works internally.  Many engineers know not to 'block' the Event Loop, but they don't necessarily understand why.  You will be one of the engineers who can clearly articulate the performance profile of Node and its Event Loop."
  },

  {
    "_id": "2e78e5e0310c2e9adbb6efb1a263e745",
    "category_id": "05",

    "total_enroll": 73,
    "title": "Redux",
    "published_date": "2022-08-30 15:00:04",
    "price": 8,
    "image_url": "https://ih1.redbubble.net/image.413059324.7813/st,small,507x507-pad,600x600,f8f8f8.u1.jpg",
    "details": "Master React and Redux with React Router, Webpack, and Create-React-App. Includes Hooks! Thousands of other engineers have learned React and Redux, and you can too.  This course uses a time-tested, battle-proven method to make sure you understand exactly how React and Redux work, and will get you a new job working as a software engineer or help you build that app you've always been dreaming about."
  },

  {
    "_id": "a713ee936ff5574273f0f769f5c5b20e",
    "category_id": "06",

    "total_enroll": 111,
    "title": "Next Js",
    "published_date": "2022-04-24 23:15:00",
    "price": 16,
    "image_url": "https://cdn-ak.f.st-hatena.com/images/fotolife/d/dev04K/20220110/20220110141023.jpg",
    "details": "Your journey into the depths of Next.js for developing blazing fast web applications at scale, made straightforward. With Next.js, you can build dynamic JAM stack based web applications. Plus, the support of Serverless functions takes the concept of a dynamic web application, a step further. You can write backend logic within the same Next.js application."
  }
]
